Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Display a MsgBox that shows $hMsgBox is a function.
fr: Affiche une MsgBox qui montre que $hMsgBox est une fonction.

source: User-defined message box function.
fr: Fonction boîte de message défini par l'utilisateur.

source: Checks if a variable's base type is a pointer and window handle.
fr: Vérifie si le type de base d'une variable est un pointeur et un handle de fenêtre.

source: 1 if the expression is a pointer type AND a valid window handle.
fr: Retourne 1 si l'expression est un type de pointeur et un handle fenêtre valide.

source: 0 if expression is not a pointer OR not a valid window handle.
fr: Retourne 0 si l'expression n'est pas un pointeur OU n'est pas un handle fenêtre valide.

source: Test if the window was found and display the results.
fr: Teste si la fenêtre a été trouvé et affiche les résultats.

source: Checks if the value of a variable or expression has no fractional component.
fr: Vérifie si la valeur d'une variable ou d'une expression n'a pas de partie fractionnaire.

source: 1 - No fractional component
fr: Retourne 1 - Aucune partie fractionnaire

source: 0 - Fractional component
fr: Retourne 0 - une partie fractionnaire existe

source: The function will return 1 if the value is a float with no fractional component (e.g.1.000).
fr: La fonction retourne 1 si la valeur est un 'float' sans partie fractionnaire (par exemple 1000).

source: Returns 1 since it evaluates to integer 3
fr: Retourne 1 car il teste l'entier 3

source: Checks if a variable is a keyword (for example, Default).
fr: Vérifie si une variable est un mot-clé (par exemple, 'Default' ).

source: The variable to check.
fr: La variable à vérifier.

source: $KEYWORD_DEFAULT (1) the Default keyword.
fr: Retourne $KEYWORD_DEFAULT (1), le mot-clé 'Default'.

source: $KEYWORD_NULL (2) the Null keyword.
fr: $KEYWORD_NULL (2), le mot-clé Null.

source: 0 if not a keyword.
fr: Retourne 0 si ce n'est pas un mot-clé.

source: Check if a variable is the Default keyword.
fr: Vérifie si une variable est le mot-clé 'Default'.

source: Check if a variable is the Null keyword.
fr: Vérifie si une variable est le mot clé Null.

source: This will be false as $sString is a string datatype.
fr: C'est faux que $sChaine est un type de donnée chaîne.

source: Checks if a variable's base type is numeric.
fr: Vérifie si le type de base d'une variable est numérique.

source: 0 if expression is not numeric type.
fr: Retourne 0 si l'expression n'est pas de type numérique.

source: A number can be an integer/whole number or a fractional/floating-point.
fr: Un nombre peut être un nombre integer/entier ou un décimal/nombre à virgule flottante.

source: If the variable is a numeric value represented as a string, then IsNumber() will return 0.
fr: Si la variable est une valeur numérique représentée dans chaîne, alors IsNumber() retournera 0.

source: Checks if a variable or expression is an object type.
fr: Vérifie si une variable ou une expression est du type objet.

source: 1 if expression is an object variable.
fr: Retourne 1 si expression est une variable objet.

source: 0 if expression is not an object variable.
fr: Retourne 0 si l'expression n'est pas une variable d'objet.

source: Checks if a variable's base type is a pointer.
fr: Vérifie si le type de base d'une variable est un pointeur.

source: 1 if the expression is a pointer type.
fr: Retourne 1 si l'expression est du type de pointeur.

source: 0 if expression is not pointer type.
fr: Retourne 0 si l'expression n'est pas du type pointeur.

source: Test if $hWnd is a valid pointer and display the results.
fr: Teste si $hWnd est un pointeur valide et affiche les résultats.

source: Checks if a variable is a string type.
fr: Vérifie si une variable est de type chaîne.

source: 0 if expression is not string type.
fr: Retourne 0 si l'expression n'est pas de type chaîne.

source: Keyboard functions Reference
fr: Keyboard - Référence Fonctions

source: Sends simulated keystrokes to the active window.
fr: Simule l'appui sur des touches du clavier et envoie la valeur dans la fenêtre active.

source: Attempts to keep a specified window active during Send().
fr: Tente de garder une fenêtre spécifiée active pendant Send().

source: Calculates the natural logarithm of a number.
fr: Calcule le logarithme naturel d'un nombre.

source: Any positive number.
fr: Tout nombre strictement positif.

source: the parameter's natural logarithm.
fr: Retourne le logarithme naturel du paramètre.

source: Tends to return -1.#IND for non-positive parameters.
fr: Retourne -1.#IND (indéterminé) pour un paramètre négatif.

source: @error is always 0
fr: @error est toujours 0

source: Assign a Local variable the natural logarithm of 1000.
fr: Assigne une variable locale avec logarithme naturel de 1000.

source: Assign a Local variable the base-10 natural logarithm of 1000.
fr: Assigne une variable locale avec le logarithme base 10 de 1000.

source: User-defined function for common log
fr: Fonction utilisateur pour le log commun (base 10)

source: 10 is the base
fr: 10 est la base

source: Math user defined functions Reference
fr: Math - Référence

source: When using them you need to add a #include <Math.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <Math.au3>.

source: Returns a seven-element array containing the memory information:
fr: Retourne un tableau à sept éléments contenant les informations de la mémoire :

source: $aArray[0] = Memory Load (Percentage of memory in use)
fr: $aArray[0] = charge mémoire ( pourcentage de mémoire utilisée )

source: $aArray[1] = Total physical RAM
fr: $aArray[1] = RAM physique totale

source: $aArray[2] = Available physical RAM
fr: $aArray[2] = RAM physique disponible

source: $aArray[4] = Available Pagefile
fr: $aArray[4] = Disponible Pagefile

source: $aArray[5] = Total virtual
fr: $aArray[5] = total virtuelle

source: $aArray[6] = Available virtual
fr: $aArray[6] = Disponible virtuelle

source: All memory sizes are in kilobytes.
fr: Toutes les tailles de mémoire sont en kilo-octets .

source: Memory user defined functions Reference
fr: Memory - Référence

source: Message Boxes and Dialogs functions Reference
fr: Message Boxes and Dialogs - Référence Fonctions

source: Displays an input box to ask the user to enter a string.
fr: Affiche une boîte de saisie pour demander à l'utilisateur de saisir une chaîne.

source: Displays a simple message box with optional timeout.
fr: Affiche une simple boîte de message, avec temporisation optionnelle.

source: Turns Progress window off.
fr: Ferme une fenêtre de progression.

source: Creates a customizable progress bar window.
fr: Crée une fenêtre de barre de progression personnalisable.

source: Sets the position and/or text of a previously created Progress bar window.
fr: Définit la position et/ou le texte d'une fenêtre de barre de progression précédemment créé.

source: Creates a customizable image popup window.
fr: Crée une fenêtre d'image popup personnalisable.

source: Turns SplashText or SplashImage off.
fr: Désactive SplashText ou SplashImage.

source: Creates a customizable text popup window.
fr: Crée une fenêtre de texte popup personnalisable.

source: Creates a tooltip anywhere on the screen.
fr: Crée une info-bulle n'importe où sur l'écran.

source: Misc user defined functions Reference
fr: Misc - Référence

source: When using them you need to add a #include <Misc.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <Misc.au3>.

source: Performs the modulus operation.
fr: Effectue l'opération modulo (reste d'une division).

source: The dividend.
fr: Le dividende.

source: The divisor.
fr: Le diviseur.

source: the remainder when value1 is divided by value2.
fr: Retourne le reste lorsque valeur1 est divisé par valeur2.

source: -1.#IND if the divisor is zero.
fr: Retourne -1.#IND (indéterminé) si le diviseur est zéro.

source: This function guarantees that Mod(dividend, divisor) = dividend - Int(dividend / divisor) * divisor.
fr: Cette fonction garantit que Mod(dividend, divisor) = dividend - Int ( dividende/diviseur) * diviseur.

source: This function does not guarantee that dividend or divisor can be represented, specifically with floating point numbers.
fr: Cette fonction ne garantit pas que le dividende ou le diviseur peut être représentée, en particulier avec des nombres à virgule flottante.

source: If integers are passed this function does an integral modulo operation.
fr: Si des 'integer' sont passés, cette fonction fait une opération modulo.

source: Otherwise it falls back to a floating point operation which per the previous remark means it may not produce the expected output.
fr: Sinon, l'opération revient à une opération en virgule flottante qui par la remarque précédente signifie qu'elle ne peut pas produire le résultat attendu.

source: Assign a Local variable the number 18.
fr: Assigne une variable locale le nombre 18.

source: If the mudulus operation of $iNb by 2 equals to 0 then $iNb is even.
fr: Si l'opération modulo de $INB par 2 est égal à 0, alors $INB est pair.

source: Assign a Local variable the modulus operation of 4 by 7.
fr: Assigne une variable locale avec l'opération modulo de 4 par 7.

source: 4%7 = 4 because the divisor > dividend
fr: 4 % 7 = 4 car le diviseur > dividende

source: Assign a Local variable the modulus operation of 1 by 3/4.
fr: Assigne une variable locale avec l'opération modulo de 1 par 3/4 par.

source: 1%(3/4) = 0.25 because the divisor is a float
fr: 1 % (3/4) = 0,25, car le diviseur est un flotteur

source: Mouse functions Reference
fr: Mouse - Référence Fonctions

source: Perform a mouse click operation.
fr: Effectue une opération de clic de souris.

source: Perform a mouse click and drag operation.
fr: Effectue un clic de souris et une opération de glissement.

source: Perform a mouse down event at the current mouse position.
fr: Déclenche l'événement 'bouton enfoncé' à la position actuelle de la souris.

source: Returns the cursor ID Number for the current Mouse Cursor.
fr: Retourne l'identifiant du curseur courant de la souris.

source: Retrieves the current position of the mouse cursor.
fr: Récupère la position actuelle du curseur de la souris.

source: Moves the mouse pointer.
fr: Déplace le pointeur de la souris.

source: Perform a mouse up event at the current mouse position.
fr: Déclenche l'événement de souris 'bouton relaché' à la position actuelle de la souris.

source: Moves the mouse wheel up or down.
fr: Tourne la roulette de la souris vers le haut ou vers le bas.

source: The button to click:
fr: Le bouton à cliquer :

source: "left", "right", "middle", "main", "menu", "primary", "secondary".
fr: "left", "right", "middle", "menu", "primary", "secondary ".

source: The x/y coordinates to move the mouse to.
fr: Les coordonnées x,y où déplacer la souris.

source: If no x and y coords are given, the current position is used (default).
fr: Si aucune coordonnée n'est donné, la position actuelle est utilisée (par défaut).

source: the speed to move the mouse in the range 1 (fastest) to 100 (slowest).
fr: la vitesse de déplacement de la souris dans la plage de 1 (le plus rapide ) à 100 (le plus lent ).

source: A speed of 0 will move the mouse instantly.
fr: Une vitesse de 0 déplacera la souris instantanément.

source: Default speed is 10.
fr: La vitesse par défaut est 10.

source: 0, the button is not in the list or invalid parameter as x without y.
fr: Retourne 0, le bouton n'est pas dans la liste ou un paramètre est invalide comme x sans y.

source: If the button is an empty string, the left button will be clicked.
fr: Si le bouton est une chaîne vide, le bouton gauche sera cliqué.

source: If x or y equal to the Default keyword no move occurs in the corresponding coordinate.
fr: Si x ou y est égal au mot-clé Default aucun mouvement ne se produit dans la coordonnée correspondante.

source: If the user has swapped the left and right mouse buttons in the control panel, then the behaviour of the buttons is different."Left" and "right" always click those buttons, whether the buttons are swapped or not.
fr: Si l'utilisateur a inversé ses boutons de souris gauche et droit dans le panneau de contrôle, alors le comportement des boutons est différent.

source: Double click at the current mouse position.
fr: Double-clique sur la position actuelle de la souris.

source: Double click at the x, y position of 0, 500.
fr: Double-clique sur la position (x, y) = (0, 500).

source: This is a better approach as it takes into account left/right handed users.
fr: C'est une meilleure approche car elle prend en compte gaucher/droitier.

source: The x/y coords to start the drag operation from.
fr: Les coordonnées x,y pour démarrer l'opération de glissement.

source: The x/y coords to end the drag operation at.
fr: Les coordonnées x,y pour mettre fin à l'opération de glissement.

source: 0, the button is not in the list.
fr: Retourne 0, le bouton n'est pas dans la liste.

source: See the table in MouseClick for more explanation
fr: Consultezle tableau de MouseClick pour plus d'explications.

source: Left click drag from 0, 200 to 600, 700
fr: Clic gauche et glissement de (0,200) à (600,700)

source: See MouseClick remarks.
fr: Consultez les remarques de MouseClick.

source: User responsibility:
fr: Responsabilité de l'utilisateur:

source: For every MouseDown() there should eventually be a corresponding MouseUp() event.
fr: Pour chaque MouseDown() il devrait lui correspondre un événement MouseUp().

source: Set the left mouse button state as down.
fr: Définit l'état du bouton gauche de la souris à "down" (bouton enfoncé).

source: Set the left mouse button state as up.
fr: Définit l'état du bouton gauche de la souris à "up" (bouton relaché).

source: Returns a cursor ID Number:
fr: Retourne un identifiant du curseur:

source: 4 = HELP
fr: 4 = AIDE

source: Allow time for the cursor to change its state.
fr: Prévoyez du temps pour changer l'état du curseur.

source: Create an array of possible cursor states using StringSplit.
fr: Crée un tableau d'états de curseurs possibles, en utilisant StringSplit.

source: The flag parameter is set to flag = 2 as we don't require the total count of the array.
fr: Le paramètre de drapeau est mis à flag = 2 que nous n'exigeons pas le nombre total de la matrice.

source: Use the CursorID value as the index value of the array
fr: Utiliser la valeur cursorID que la valeur de l'indice de la matrice

source: argument that determines what the return value will be.
fr: Argument qui détermine ce que sera la valeur de retour.

source: See Return Value.
fr: Voir Valeur de retour.

source: Values
fr: valeurs

source: Returns a two-element array containing the mouse coordinates:
fr: Retourne un array à 2 éléments contenant les coordonnées de la souris :

source: $aArray[0] = X coord (horizontal), $aArray[1] = Y coord (vertical)
fr: $aArray[0] = X (abscisse), $aArray[1] = Y (ordonnée)

source: Returns the X co-ordinate as an integer.
fr: Retourne l'abscisse X sous la forme d'un 'integer'.

source: Returns the Y co-ordinate as an integer.
fr: Retourne l'ordonnée Y sous la forme d'un 'integer'.

source: If dimension is not a number @error will be set to 1.
fr: Si 'dimension' n'est pas un nombre @error = 1.

source: See MouseCoordMode for relative/absolute position settings.
fr: Voir MouseCoordMode pour paramètrer la position relative/absolue.

source: If relative positioning, numbers may be negative.
fr: Si le positionnement est relatif, les nombres retournés peuvent être négatifs.

source: The screen x coordinate to move the mouse to.
fr: L'abscisse x, dans l'écran, du point où déplacer la souris.

source: The screen y coordinate to move the mouse to.
fr: L'ordonnée y, dans l'écran, du point où déplacer la souris.

source: User mouse movement is hindered during a non-instantaneous MouseMove() operation.
fr: Les mouvements de la souris provoqués par l'utilisateur sont entravés pendant le fonctionnement de MouseMove() lorsque la 'speed' n'est pas 0.

source: If MouseCoordMode is relative positioning, numbers may be negative.
fr: Si MouseCoordMode est paramétré en positionnement relatif, les nombres peuvent être négatifs.

source: Move the mouse cursor to the x, y position of 10, 100.
fr: Déplace le curseur de la souris à la position (10, 100).

source: Move the mouse cursor to the x, y position of 700, 700 and move instantly.
fr: Déplace le curseur de la souris à les position (700, 700) et le déplace instantanément.

source: "up" or "down"
fr: "up" ou "down"

source: The number of times to move the wheel.
fr: Le nombre de pas de rotation de la roulette.

source: 0, the direction is not recognized.
fr: Retourne 0, 'direction' n'est pas reconnue.

source: Move the mouse wheel up ten times.
fr: Tourne la roulette de la souris de dix pas.

source: The flag indicates the type of message box and the possible button combinations.
fr: Ce paramètre indique le type de boîte de message et les combinaisons de boutons possibles.

source: The title of the message box.
fr: Le titre de la boîte de message.

source: The text of the message box.
fr: Le texte de la boîte de message.

source: Timeout in seconds.
fr: Temporisation en secondes.

source: After the timeout has elapsed the message box will be automatically closed.
fr: Après la temporisation, la boite de message sera automatiquement fermée.

source: The default is 0, which is no timeout.
fr: La valeur par défaut est 0, ce qui équivaut à aucune temporisation.

source: the ID of the button pressed.
fr: Retourne ID du bouton pressé.

source: $IDTIMEOUT (-1) if the message box timed out.
fr: Retourne $IDTIMEOUT (-1) si la temporisation de la boîte de dialogue est dépassée.

source: Constants are defined in MsgBoxConstants.au3
fr: Les constantes sont définies dans MsgBoxConstants.au3

source: The flag parameter can be a combination of the following values:
fr: Le paramètre 'flag' peut être une combinaison des valeurs suivantes :

source: Constant Name
fr: Nom de constante

source: Decimal flag
fr: Flag

source: Button-related result
fr: Effet relatif aux boutons

source: Hexadecimal flag
fr: Flag hexadécimal

source: OK button
fr: Bouton OK

source: OK and Cancel
fr: OK et Annuler

source: Abort, Retry, and Ignore
fr: Abandonner, Recommencer, et Ignorer

source: Yes, No, and Cancel
fr: Oui, Non, et Annuler

source: Yes and No
fr: Oui et Non

source: Retry and Cancel
fr: Recommencer et Annuler

source: Cancel, Try Again, Continue
fr: Annuler, Réessayer, Continuer

source: Adds a Help button to the message box.
fr: Ajouter un bouton d'aide à la boîte de message.

source: When the user clicks the Help button or presses F1, the system sends a WM_HELP message to the owner.
fr: Quand l'utilisateur clique sur le bouton Help ou presse F1, le system envoie un message WM_HELP à la fenêtre.

source: decimal flag
fr: Flag

source: Icon-related Result
fr: Effet relatif à l'icône

source: hexadecimal flag
fr: Flag hexadécimal

source: (No icon)
fr: pas d'icône

source: Stop-sign icon
fr: Icône Stop

source: Question-mark icon
fr: Icône point d'interrogation

source: Exclamation-point icon
fr: Icône point d'exclamation

source: Information-sign icon consisting of an 'i' in a circle
fr: Icône Information ('i' dans un cercle)

source: Default-related Result
fr: Effet relatif aux valeurs par défaut

source: First button is default button
fr: Le premier bouton est le bouton par défaut

source: Second button is default button
fr: Le deuxième bouton est le bouton par défaut

source: Third button is default button
fr: Le troisième bouton est le bouton par défaut

source: Fourth button is default button
fr: Le quatrième bouton est le bouton par défaut

source: Modality-related Result
fr: Effet relatif à la modalité

source: System modal (dialog has an icon)
fr: Système modal (la boîte de dialogue a une icône)

source: Task modal
fr: Tâche modale

source: Miscellaneous-related Result
fr: Effet divers

source: (nothing else special)
fr: (rien de spécial)

source: MsgBox() shows on the desktop of the interactive window station.
fr: MsgBox() s'affiche sur le bureau de la fenêtre interactive.

source: title and text are right-justified
fr: Le titre et le texte sont justifiés à droite

source: Displays message and caption text using right-to-left reading order on Hebrew and Arabic systems.
fr: Affiche un message et un titre en utilisant l'ordre de lecture 'droite-gauche' sur les systèmes Hebreu et Arabe.

source: The message box becomes the foreground window.
fr: La boîte de message s'ouvre en arrière plan de la fenêtre.

source: MsgBox() has top-most attribute set
fr: MsgBox() possède l'attribut 'top-most' (premier plan)

source: The function displays a message box on the current active desktop, even if there is no user logged on to the computer.
fr: La fonction affiche une boîte de message sur le bureau actif en cours, même s'il n'y a pas d'utilisateur connecté à l'ordinateur.

source: For example, to specify a SYSTEMMODAL box with the YES/NO buttons the flag value would be 4096+4 (or 4100) If using hexadecimal flags, that would be 0x1000+0x4 (or 0x1004).
fr: Par exemple, pour spécifier une boîte SYSTEMMODAL avec les boutons YES/NO, la valeur du 'flag' serait 4096+4 (ou 4100).En utilisant les valeurs hexadécimales des flags, ce serait 0x1000+0x4 (ou 0x1004).

source: A message box appears centered on screen and resizes according to the text it contains.
fr: Une boîte de dialogue apparaît centrée sur l'écran et est redimensionnée selon le texte qu'elle contient.

source: However, the title could get truncated if the SYSTEMMODAL flag (4096) is used..
fr: Cependant, le titre pourrait être tronqué si l'option SYSTEMMODAL (4096) est utilisée.

source: If "title" is equal to Default keyword @Scriptname is used
fr: Si "title" est égal au mot-clé Default, @Scriptname est utilisé.

source: Display a message box with a nested variable in its text.
fr: Affiche une boîte de message avec une variable incluse dans le texte.

source: NamedPipes user defined functions Reference
fr: NamedPipes - Référence

source: When using them you need to add a #include <NamedPipes.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <NamedPipes.au3>.

source: NetShare user defined functions Reference
fr: NetShare - Référence

source: When using them you need to add a #include <NetShare.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <NetShare.au3>.

source: Network functions Reference
fr: Network - Référence Fonctions

source: Pings a host and returns the roundtrip-time.
fr: Ping un hôte et retourne le temps de réponse.

source: Permits an incoming connection attempt on a socket.
fr: Permet une tentative de connexion entrante sur un socket.

source: Closes a TCP socket.
fr: Ferme un socket TCP.

source: Create a socket connected to an existing server.
fr: Crée un socket connecté à un serveur existant.

source: Creates a socket listening for an incoming connection.
fr: Crée un socket d'écoute pour une connexion entrante.

source: Converts an Internet name to IP address.
fr: Convertit un nom de domaine en adresse IP.

source: Receives data from a connected socket.
fr: Reçoit des données d'un socket connecté.

source: Sends data on a connected socket.
fr: Envoie des données à un socket connecté.

source: Stops TCP/UDP services.
fr: Arrête les services TCP/UDP.

source: Starts TCP or UDP services.
fr: Démarre les services TCP ou UDP.

source: Create a socket bound to an incoming connection.
fr: Crée un socket lié à une connexion entrante.

source: Close a UDP socket.
fr: Ferme un socket UDP.

source: Open a socket connected to an existing server .
fr: Ouvre un socket connecté à un serveur existant.

source: Receives data from an opened socket.
fr: Reçoit des données d'un socket ouvert.
